# your_lang = 'Это твой язык'

def generate_confirmation_msg(name):
    return f"{name} - так будет называться Ваша команда. Уверены?"

help_message = """По всем вопросам обращайтесь к координаторам в мастер-локации."""

no_code_enter = 'Вы вошли не по коду'

welcome = """С днём шахтёра!
QR-квест состоит из 7 локаций с заданиями.
Выполняйте задания в локациях, пишите ответы в чат-бот и повышайте уровень веселья своей
команды."""

enter_team_name = "Готовы? Напишите название своей команды."

enter_another_name = "Хорошо, введите другое имя для вашей команды."

succes_registrated = "Отлично! Ваша команда зарегистрирована. Чтобы начать QR-квест, нажмите на кнопку ⤵"

map_instruction = """Это карта с локациями QR-квеста. Порядок прохождения локаций указан в вашем маршрутном листе.
Двигайтесь строго по указанному маршруту."""

route_header = "Маршрут вашей команды:"

route_instruction = 'Чтобы приступить к выполнению задания, нажмите на кнопку с названием локации.'

task1 = """Угадайте ингредиенты коктейля и напишите сюда ваши ответы.
Важно: каждый ингредиент необходимо прислать отдельным сообщением!"""

already_answered = 'Уже было.'

wrong_answer = 'Ответ неверный.'

confirm_task_finish = 'Вы уверены, что хотите закончить? Позже вы не сможете вернуться к этому заданию.'

use_kb = 'Используйте клавиатуру.'

correct_ans_header = 'Верно!'

task_already_completed = 'Задание уже пройдено'





task1_ans = {'МЯТА': '1',
             'ЛАЙМ': '2',
             'СИРОП БУЗИНЫ': '3', 
             'БУЗИНА': '3', 
             'СОДОВАЯ' : '4',
             'ПРОСЕККО': '5', 
             'ПРОСЕКО': '5', 
             'ПРОССЕКО':'5', 
             'PROSECCO': '5'}


begin_quest_btn = "Начать QR-квест"
yes_btn = 'Да'
no_btn = 'Нет'
places_btns = ['Коктейли', 'Послание в бутылке',
               'Роспись касок', 'Фотодобыча', 
               'Числошифры', 'Танцевальный баттл', 'Подарки']
finish_task_btn = 'Закончить'


